[
    {
        "name": "Chicken Parmesan",
        "instructions": "1. Preheat an oven to 450 degrees F\n2. Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper\n3. Beat eggs in a shallow bowl and set aside.\n4. Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside.\n5. Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides.\n6. Dip a flour-coated chicken breast in beaten eggs. Transfer breast to the bread crumb mixture, pressing crumbs into both sides. Repeat for each breast. Let chicken rest for 10 to 15 minutes\n7. Heat 1/2 inch olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken in the hot oil until golden, about 2 minutes per side. The chicken will finish cooking in the oven.8. Transfer chicken to a baking dish. Top each breast with 2 tablespoons tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle remaining Parmesan over top and drizzle each with 1/2 teaspoon olive oil.\n9. Bake in the preheated oven until cheese is browned and bubbly and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "ingredients": "- 4 skinless, boneless chicken breast halves\n- salt and freshly ground black pepper to taste\n- 2 large eggs\n- 1 cup panko bread crumbs, or more as needed\n- ¾ cup grated Parmesan cheese, divided\n- 2 tablespoons all-purpose flour, or more if needed\n- ½ cup olive oil for frying, or as needed\n- ½ cup prepared tomato sauce\n- ¼ cup fresh mozzarella, cut into small cubes\n- ¼ cup chopped fresh basil\n- ½ cup grated provolone cheese\n- 2 teaspoons olive oil"
    },
    {
        "name": "Calzone",
        "instructions": "1.Preheat the oven to 475 °F. Line the baking sheet with parchment paper or spray it with oil.\n2.Divide the dough into 8 equally sized pieces. Roll each piece into a 1/4 inch thick circle.\n3.Place the filling on half of each circle (pizza sauce, ricotta, pepperoni, salami and shredded mozzarella). Make sure to leave the edges clean to allow for sealing the calzone. Fold the side over the filling and crimp the edges.\n4.Place calzones on a baking sheet, leaving space apart. Cut a small vent on the top of each calzone. Brush the tops with oil and sprinkle with parmesan cheese. Bake for 15 minutes or until golden brown.",
        "ingredients" : "2 lb pizza dough\n1 cup pizza sauce\n1 cup pepperoni\n1/2 cup salami\n2 cups shredded mozzarella\n1 cup ricotta cheese\n2 tbsp oil\n1/2 cup parmesan cheese"
    }
    ,
    {
        "name": "Coconut Shrimp",
        "instructions": "1.Rinse shrimp in cold water and pat dry with paper towels.\n2.Set up 3 shallow bowls. In the first, stir together 1/4 cup flour, 1/2 tsp garlic powder and 1/2 tsp salt. In the second, beat 2 eggs with a fork. In the third, combine 1 1/2 cups coconut flakes and 1/2 cup panko bread crumbs.\n3.Dredge shrimp in flour, then dip in beaten egg and finally dip in crumb mixture using your hands to press the coconut crumb mixture onto your shrimp. Transfer to a platter and repeat with remaining shrimp. Once all shrimp are breaded, either sauté right away or refrigerate for later.\n4.To sautee: place a large pan over medium heat and add enough oil to generously cover the bottom (1/4 inch deep). Once oil is hot (350˚F), add shrimp and sauté 2 minutes per side until golden brown and shrimp is pink and cooked through. Cook in batches and dont overcrowd the pan.\n5.Stir together 1/4 cup sweet chili sauce with 1/4 cup apricot preserves. Serve shrimp with dipping sauce and squeeze fresh lime juice over finished shrimp before serving if desired.",
        "ingredients" : "1 lb large shrimp, 21-25 count, peeled and deveined with tails left on\n1/4 cup all-purpose flour\n1/2 tsp garlic powder\n1/2 tsp salt\n2 large eggs, beaten with a fork\n1 1/2 cups sweetened shredded coconut\n1/2 cup panko bread crumbs\nlight olive oil, or vegetable oil or coconut oil\n1 lime, cut into wedges, to serve"
    }

]